[
    {
        "question": "Who won the Stylish Wizard of the Year award?",
        "SPQRQL": "SELECT ?name WHERE {?award a hp:Stylish_wizard_of_the_year ;hp:name ?name .}"
    },
    {
        "question": "Who is the wife of Cornelius Fudge?",
        "SPQRQL": "SELECT ?name WHERE { hp:Cornelius_fudges_wife hp:husband hp:Cornelius_fudge ; hp:name ?name .}"
    },
    {
        "question": "What are the names and affiliations of the individuals who are affiliated with both the British Ministry of Magic and the Order of the Phoenix?",
        "SPQRQL": "SELECT DISTINCT ?name ?affiliation WHERE { ?individual hp:affiliation hp:British_ministry_of_magic, hp:Order_of_the_phoenix ; hp:name ?name ; hp:species hp:Human ; hp:affiliation ?affiliation .}"
    },
    {
        "question": "Who are the leaders of the International Confederation of Wizards and the Educational Office in the Harry Potter universe?",
        "SPQRQL": "SELECT DISTINCT ?leader1 ?leader2 WHERE { hp:International_confederation_of_wizards hp:leader ?leader1 . hp:Educational_office hp:leader ?leader2 .}"
    },
    {
        "question": "Who are the male individuals affiliated with Ravenclaw House in the Harry Potter universe?",
        "SPQRQL": "SELECT DISTINCT ?name WHERE { ?individual hp:affiliation hp:Ravenclaw ; hp:gender hp:Male ; hp:name ?name ; hp:species hp:Human .}"
    },
    {
        "question": "What is the name and gender of the wizard who won the Stylish Wizard of the Year award?",
        "SPQRQL": "SELECT ?wizardName ?gender WHERE { hp:Stylish_wizard_of_the_year hp:name ?wizardName ; hp:gender ?gender .}"
    },
    {
        "question": "Who is the Chief Warlock of the Wizengamot and what was his title in 1544?",
        "SPQRQL": "SELECT ?currentChiefWarlock ?title1544 WHERE { ?currentChiefWarlock hp:job hp:Chief_warlock, hp:Wizengamot ; hp:name ?name ; hp:title ?title1544 . FILTER(CONTAINS(?title1544, \"1544\"))}"
    },
    {
        "question": "Which organization does Hermione Granger work for?",
        "SPQRQL": "SELECT ?organization_name WHERE { hp:Hermione_granger hp:job ?job_title . ?job_title hp:name ?organization_name . FILTER(CONTAINS(?organization_name, \"Office\"))}"
    },
    {
        "question": "What are the names and genders of individuals associated with the Hogwarts School of Witchcraft and Wizardry, and what are their loyalties?",
        "SPQRQL": "SELECT ?name ?gender ?loyalty WHERE { ?individual hp:gender ?gender ; hp:loyalty ?loyalty ; hp:theme hp:Mom ; hp:species hp:Human ; hp:name ?name . FILTER regex(?loyalty, \"Hogwarts_school_of_witchcraft_and_wizardry\")}"
    },
    {
        "question": "Who are the members of the Fudge family and what are their relationships to Cornelius Fudge?",
        "SPQRQL": "SELECT ?name ?relationship WHERE { ?individual hp:name ?name ; hp:family ?fudge_member ; hp:husband hp:Cornelius_fudge ; hp:loyalty ?loyalty ; hp:species hp:Human . FILTER regex(?fudge_member, \"Fudge_family\") BIND(IF(?name = \"Cornelius Fudge's Wife\", \"Wife\", \"Nephew\") AS ?relationship)}"
    },
    {
        "question": "Who are the individuals associated with the British Ministry of Magic's Department of Magical Law Enforcement?",
        "SPQRQL": "SELECT ?individual WHERE { ?individual hp:affiliation hp:British_ministry_of_magic . ?individual hp:job hp:Department_of_magical_law_enforcement .}"
    },
    {
        "question": "Who is the Chief Warlock of the Wizengamot and what was their job?",
        "SPQRQL": "SELECT ?name ?job WHERE { ?person hp:name ?name ; hp:job ?job ; hp:Chief_warlock true .}"
    },
    {
        "question": "What organization is Cornelius Fudge's wand affiliated with?",
        "SPQRQL": "SELECT ?org WHERE { hp:Cornelius_fudges_wand hp:affiliation ?org .}"
    },
    {
        "question": "Who is the head of the Educational Office and what organization are they affiliated with?",
        "SPQRQL": "SELECT ?name ?org WHERE { ?person hp:name ?name ; hp:leader ?org ; hp:Educational_office true .}"
    },
    {
        "question": "Who is Cornelius Fudge's wife and what is her relationship to Rufus Fudge?",
        "SPQRQL": "SELECT ?name ?relationship WHERE { ?person hp:husband hp:Cornelius_fudge ; hp:nephew hp:Rufus_fudge ; hp:name ?name ; hp:species hp:Human .}"
    },
    {
        "question": "Who are the individuals affiliated with the Department of Magical Accidents and Catastrophes who have a job title?",
        "SPQRQL": "SELECT ?individual ?title WHERE { ?individual hp:affiliation hp:Department_of_magical_accidents_and_catastrophes ; hp:title ?title . FILTER isIRI(?individual) && isIRI(?title) }"
    },
    {
        "question": "Who are the wizards who have won the Stylish Wizard of the Year award and what is their gender?",
        "SPQRQL": "SELECT ?wizard ?gender WHERE { hp:Stylish_wizard_of_the_year hp:winner ?wizard . OPTIONAL { ?wizard hp:gender ?gender . }}"
    },
    {
        "question": "Who are the individuals affiliated with the British Ministry of Magic who are also members of the Order of the Phoenix?",
        "SPQRQL": "SELECT ?individual WHERE { ?individual hp:affiliation hp:British_ministry_of_magic . ?individual hp:loyalty hp:Order_of_the_phoenix . }"
    },
    {
        "question": "Which individuals have been affiliated with the British Ministry of Magic, have held a job in the Department of Magical Law Enforcement, and are also members of the Order of the Phoenix?",
        "SPQRQL": "SELECT ?individual WHERE { ?individual hp:affiliation hp:British_ministry_of_magic . ?individual hp:job hp:Department_of_magical_law_enforcement . ?individual hp:loyalty hp:Order_of_the_phoenix . }"
    },
    {
        "question": "What are the names of the individuals who are affiliated with the British Ministry of Magic and have a job that includes the title \"chief warlock\"?",
        "SPQRQL": "SELECT ?name WHERE { ?individual hp:affiliation hp:British_ministry_of_magic . ?individual hp:job ?job . ?job hp:title ?title . FILTER regex(?title, \"chief warlock\", \"i\") . ?individual hp:name ?name . }"
    },
    {
        "question": "What are the affiliations of Queenie Goldstein and what is her species?",
        "SPQRQL": "SELECT ?affiliation ?species WHERE { hp:Queenie_goldstein hp:affiliation ?affiliation ; hp:species ?species . }"
    },
    {
        "question": "Who are the advisors to the Minister for Magic?",
        "SPQRQL": "SELECT ?advisor WHERE { hp:Advisor_to_the_minister_for_magic rdfs:label ?advisor .}"
    },
    {
        "question": "Who are the individuals affiliated with the British Ministry of Magic who have held the job of Minister for Magic?",
        "SPQRQL": "SELECT ?individual WHERE { ?individual hp:affiliation hp:British_ministry_of_magic ; hp:job hp:Minister_for_magic .}"
    },
    {
        "question": "What are the names of the individuals affiliated with the British Ministry of Magic who have been appointed Chief Warlock of the Wizengamot?",
        "SPQRQL": "SELECT ?name WHERE { ?individual hp:affiliation hp:British_ministry_of_magic ; hp:job hp:Chief_warlock, hp:Wizengamot ; hp:name ?name . }"
    },
    {
        "question": "Who are the individuals affiliated with the British Ministry of Magic who have held the job of Minister for Magic and have also been members of the Order of the Phoenix?",
        "SPQRQL": "SELECT ?individual WHERE { ?individual hp:affiliation hp:British_ministry_of_magic ; hp:job hp:Minister_for_magic ; hp:loyalty hp:Order_of_the_phoenix . }"
    },
    {
        "question": "What is the name of the individual who won the Stylish Wizard of the Year award?",
        "SPQRQL": "SELECT ?name WHERE { hp:Stylish_wizard_of_the_year hp:name ?name . }"
    },
    {
        "question": "What were the names of the wizards who held the position of Chief Warlock of the Wizengamot before and after Chief Warlock of the Wizengamot in 1544?",
        "SPQRQL": "SELECT ?previousChiefWarlock ?successorChiefWarlock WHERE { hp:Chief_warlock_of_the_wizengamot_in_1544 hp:predecessor ?previousChiefWarlock . hp:Chief_warlock_of_the_wizengamot_in_1544 hp:successor ?successorChiefWarlock . ?previousChiefWarlock hp:job hp:Chief_warlock, hp:Wizengamot . ?successorChiefWarlock hp:job hp:Chief_warlock, hp:Wizengamot . FILTER(?previousChiefWarlock != hp:Chief_warlock_of_the_wizengamot_in_1544 && ?successorChiefWarlock != hp:Chief_warlock_of_the_wizengamot_in_1544) }"
    },
    {
        "question": "Which Hogwarts houses did Hermione Granger and Queenie Goldstein belong to?",
        "SPQRQL": "SELECT ?hermioneHouse ?queenieHouse WHERE { hp:Hermione_granger hp:house ?hermioneHouse . hp:Queenie_goldstein hp:house ?queenieHouse . }"
    },
    {
        "question": "What was the blood status of Cornelius Fudge's wife?",
        "SPQRQL": "SELECT ?bloodStatus WHERE { hp:Cornelius_fudges_wife hp:blood ?bloodStatus .}"
    },
    {
        "question": "What were the names of all the Hogwarts houses, and who were their respective founders?",
        "SPQRQL": "SELECT ?house ?founder WHERE { ?house hp:name ?houseName . ?founder hp:founded ?house . }"
    },
    {
        "question": "Who is the head of Hogwarts Castle?",
        "SPQRQL": "SELECT ?headmasterName WHERE { hp:Hogwarts_castle hp:owner hp:Hogwarts_school_of_witchcraft_and_wizardry . hp:Hogwarts_castle hp:location hp:Scotland . hp:Headmaster hp:seat hp:Hogwarts_castle . hp:Headmaster hp:name ?headmasterName . }"
    },
    {
        "question": "Who founded Hogwarts Castle?",
        "SPQRQL": "SELECT ?founderName WHERE { hp:Hogwarts_castle hp:owner hp:Hogwarts_school_of_witchcraft_and_wizardry . hp:Hogwarts_school_of_witchcraft_and_wizardry hp:founder ?founder . ?founder hp:name ?founderName . }"
    },
    {
        "question": "Who was the headmaster of Hogwarts castle and what was their style?",
        "SPQRQL": "SELECT ?headmasterName ?style WHERE { hp:Headmaster hp:seat hp:Hogwarts_castle . hp:Headmaster hp:name ?headmasterName . hp:Headmaster hp:style ?style . }"
    },
    {
        "question": "Who are the masters and owners of the Elder Wand?",
        "SPQRQL": "SELECT ?masterName ?ownerName WHERE { hp:Elder_wand hp:masters ?master . ?master hp:name ?masterName . hp:Elder_wand hp:owners ?owner . ?owner hp:name ?ownerName . }"
    },
    {
        "question": "Who is the enemy of the International Confederation of Wizards and who is its leader?",
        "SPQRQL": "SELECT ?enemyName ?leaderName WHERE { hp:International_confederation_of_wizards hp:enemies ?enemy . ?enemy hp:name ?enemyName . hp:International_confederation_of_wizards hp:leader ?leader . ?leader hp:name ?leaderName . }"
    },
    {
        "question": "Who is the wizard who had a romantic relationship with Albus Dumbledore and owned the Elder Wand?",
        "SPQRQL": "SELECT ?wizardName WHERE { hp:Gellert_grindelwald hp:romances hp:Albus_dumbledore . hp:Gellert_grindelwald hp:owners hp:Elder_wand . hp:Gellert_grindelwald hp:name ?wizardName . }"
    },
    {
        "question": "What is the name of the organization led by the Supreme Mugwump and who are their enemies?",
        "SPQRQL": "SELECT ?name ?enemies  WHERE { hp:International_confederation_of_wizards hp:name ?name . hp:International_confederation_of_wizards hp:enemies ?enemies . }"
    },
    {
        "question": "What is the name of the location in England with an affiliation to Mould on the Wold?",
        "SPQRQL": "WHERE { hp:Mould_on_the_wold hp:affiliation ?affiliation . ?affiliation hp:location hp:England . hp:Mould_on_the_wold hp:name ?name . }"
    },
    {
        "question": "What is the name of the organization with the leader Supreme Mugwump and an enemy of Gellert Grindelwald?",
        "SPQRQL": "SELECT ?name WHERE { hp:International_confederation_of_wizards hp:leader hp:Supreme_mugwump . hp:International_confederation_of_wizards hp:enemies hp:Gellert_grindelwald . hp:International_confederation_of_wizards hp:name ?name . }"
    },
    {
        "question": "Who are the members of Dumbledore's Army?",
        "SPQRQL": "SELECT ?member WHERE { hp:Dumbledores_army hp:affiliation ?affiliation . ?affiliation hp:name ?name . hp:Dumbledores_army hp:member ?member . } "
    },
    {
        "question": "What is the name of the location where Albus Dumbledore's wand is located?",
        "SPQRQL": "SELECT ?name WHERE { hp:Albus_dumbledores_wand hp:location ?location . ?location hp:name ?name . }"
    },
    {
        "question": "Who was the founder of Dumbledore's Army?",
        "SPQRQL": "SELECT ?founderName WHERE { hp:Dumbledores_army hp:founder ?founder . ?founder hp:name ?founderName . }"
    },
    {
        "question": "What is the blood status of Credence Barebone?",
        "SPQRQL": "SELECT ?bloodStatus WHERE { hp:Credence_barebone hp:blood ?blood . ?blood hp:name ?bloodStatus . }"
    },
    {
        "question": "What is the name of the organization led by the Supreme Mugwump?",
        "SPQRQL": "SELECT ?name WHERE { hp:International_confederation_of_wizards hp:leader hp:Supreme_mugwump . hp:International_confederation_of_wizards hp:name ?name . }"
    }

]